{"meta":{"title":"Ruoshui Li","subtitle":"","description":"","author":"Ruoshui Li","url":"http://yoursite.com","root":"/"},"pages":[{"title":"About Me","date":"2021-06-14T01:25:01.002Z","updated":"2021-04-25T02:17:35.062Z","comments":false,"path":"index.html","permalink":"http://yoursite.com/index.html","excerpt":"","text":"&nbsp;I’m Ruoshui Li (李若水), an incoming Associate at E3 (Energy and Environmental Economics,Inc.). I recived my Master in Environmental Management Degree from Duke University Nicholas School of the Environment in May 2021, where I studied fundamental knowledge in Energy system modeling, U.S. electricity markets, Energy finance and Energy Law. Before that, I was an undergraduate student majored in Environmental Science in China. As an entry-level professional in the Energy and Environment world, I am actively exploring career paths in Carbon-free power grid analysis, Resource Planning, Distributed energy resources integration, and Corporation sustainability. I hope to be part of the solution where I can leverage advanced modeling techniques and problem-solving skills to facilitate seamless and reliable energy transitions in the grid. Please see Research, Career and Writings tag for more information about my past experiences. If you have interests in either topic or simply want to have a talk, feel free to contact me! The cartoon character in my webpage is called Cooky, a cute, athletic, and passionate rabbit designed by a member of kpop group BTS, my favorite music band."},{"title":"Professional Experience","date":"2021-06-14T01:25:00.994Z","updated":"2021-04-25T02:35:20.580Z","comments":false,"path":"career/index.html","permalink":"http://yoursite.com/career/index.html","excerpt":"","text":"Associate at the Bulk Grid groupE3, starting from 07/2021 Intern at Research Center for Energy Transition and Social DevelopmentTsinghua University, 08/2020 to present Research on worldwide best-practice showcases of tri-networks integration (energy, transportation, and information networks) to explore scenarios of reaching net-zero in future power and transportation industry. Lead a group of 20 students in Germany, China and the U.S.A to research on policy and market outlook of global solar industry. Published 5 editorials (in Chinese) introducing Germany’s recent solar subsidy policy, Slovenia’s Net Metering schema, Vienna’s citizen solar plants and blockchain, Biden’s renewable energy policy, Germany’s power grid with high penetration of renewables, etc. Teaching Assistant for “Markets for Electric Power”Duke University Nicholas School of the Environment, 01/2021-05/2020 Grade assignments, holding office hours to answer questions related to basic economic and engineering concepts during electric power system operation. Guide students conducting quantitative analysis to examine the effect of different policies and market designs on building a resilient, reliable, economic, safe, and environmentally-sustainable electricity system. Teaching Assistant for “Modeling for Energy Systems”Duke University Nicholas School of the Environment, 08/2020-12/2020 Create tutorials for helping students to install Python, optimization package Pyomo and solver cbc. Instruct students on Python debugging to create multiple linear programming models in lab sessions. Grading assignments, posting solutions, and holding office hour to answer student questions in a timely manner. Mentorship programSupervised by Daniel Munoz-Alvarez, research analyst at Wood Mackenzie Power &amp; Renewables, 05/2020-08/2020 Global wind power generation algorithm: To integrate wind power into system dispatch models, having access to wind turbine outputs at specific location, under various heights, or from different turbine models during 24 hours in a day is essential. Under the guide of Daniel, I created an algorithm using Python and MySQL database to calculate hourly wind power generation with given technical parameters. The algorithm is organized as follows: Extract and mawind speed data at 2m, 10m and 50m height from NASA MERRA-2 dataset; Develop wind profile at each (latitude, longitude) point and store vertically interpolation coefficients in a remote database; Extrace wind profile coefficients and calculate wind power generation at a particular site based on user-specified turbine model, height and timing. The algorithm can also help analysts to: Compare daily /monthly / annual average potential wind generation at different sites for choosing prespective location to build new wind farms. Estimate needs for storage system in a certain area based on aggregate wind power availability. Contact me if you are interested in the code or detailed algorithm discription! Intern at QA DepartmentBoston Scientific Corporation (Shanghai), 07/2017-08/2017 Data analysis can support QA activities and operations. In the summer of 2017, I interned at Boston Scientific (Shanghai) Company, Department of Quality &amp; Assurance. My work includes analyzing monthly import and export of the company’s medical devices using Pivot Table, completing weekly reports detailing the key sale figures of twenty medical devices, to help colleagues keep track of sales data and prepare for stocks in advance."},{"title":"Personal Information","date":"2020-12-26T22:06:08.733Z","updated":"2020-12-26T22:06:08.733Z","comments":false,"path":"contact/index.html","permalink":"http://yoursite.com/contact/index.html","excerpt":"","text":"Contact +86 13851270219 or +1 919-949-1018 Ruoshui.li@duke.edu Nicholas School of the Environment, Duke University, Durham, 27708, North Carolina Yuan Chen’s homepage"},{"title":"CV","date":"2021-06-14T01:25:00.998Z","updated":"2021-04-25T02:25:51.817Z","comments":false,"path":"cv/index.html","permalink":"http://yoursite.com/cv/index.html","excerpt":"","text":"[ Contact to have a look at my CV if you’re interested!]&nbsp; Education Master in Environmental Management (Energy and Environment concentration), Duke University, May 2021 B.E. Environmental Science, Hohai University, June 2019 Skills Coding: C, Python, R, MySQL, LATEX, VBA Data Analysis: Python (pandas, numpy, scipy), R (dplyr, tidyr) Data Visulization: Python (matplotlib), R (ggplot), ECHARTS, ArcGIS pro, CIRCOS Optimization: Python (PuLP, docplex, Pyomo), IBM ILOG CPLEX Optimization Simulation: Excelsheet modeling, PowerWorld Simulator, Python (PySAM) Misc. : Academic Research, MS Office, Adobe Photoshop &amp; Premiere, Markdown Language: Mandarin Chinese, English, Spanish Hobby: Swimming, Running, Jazz drum Certificates Bloomberg Market Concepts (#160072356334), awarded by Bloomberg Certificate of Data Analyst with SQL Server (#129,356), awarded by DataCamp Certification of Data Scientist with Python (#93,176), awarded by DataCamp Certificate of Quantitative Analysis Using R(#138,613), awarded by DataCamp"},{"title":"Hello World","date":"2020-06-28T00:33:21.865Z","updated":"2020-06-25T20:03:10.539Z","comments":false,"path":"posts/writting1.html","permalink":"http://yoursite.com/posts/writting1.html","excerpt":"","text":""},{"title":"Research Description","date":"2021-06-14T01:32:08.206Z","updated":"2021-06-14T01:32:08.206Z","comments":false,"path":"research/index.html","permalink":"http://yoursite.com/research/index.html","excerpt":"","text":"Master’s Project aaSupervised by Prof. Luana Lima, Assistant Professor of Duke Nicholas School of the Environment; Associate Director of Duke Energy Initiative.Other team members include two MEM students. Solar Net Energy Metering: Net Energy Metering (NEM) schema has been recognized as an effective way to diversify energy resource mix, stimulate local economic growth, and encourage private investment in solar energy. However, several studies have shown that NEM policies are regressive onto low-income, disadvantaged communities as the revenue loss for utilities causes them to raise electricity rates in order to recover their costs. In this study, we conducted an Optimal Power Flow (OPF) analysis in Python to quantify how NEM schema can potentially change the grid power flow and lead to variance in grid congestion, Locational Marginal Price, and utility’s avoided cost. evaluated NEM policies by performing a cost-benefit analysis from the perspective of the NEM customers, non-NEM customers and the utilities, to demonstrate how NEM policies result in a net cost. finally propose several recommendations including using a time of use compensation rate, increasing fixed non-bypassable charges, and a transitional NEM credit system, etc. Sample results: (P1 to P4 represents increase in solar DGs penetration rate; while C1 to C4 indicates increase in solar capacity installed on rooftop) Renewable Energy TopicsWind farm site evaluation: Site assessment is one of the key factors in the successful installation, operation and performance of a new wind farm. Determining a properly-placed turbine usually requires a series of studies. In a research to assess 10 land parcels in western North Carolina as prospective sites for wind farm station, I used ArcGIS pro to evaluate site characteristics including: 1). its distance to flight path restriction areas and avian species inhabitants; 2). potential turbine generation given available site area and wind class; 3). total cost for each to cross terrain and be connected to existing power grids; and 4). compensation cost paid to nearby Parkway Tourist Network for remediating wind farm’s damage on scenic beauty (depending on the number of scenic overlooks fall within wind farm’s viewshed). Based on each criterion, the optimal land parcel, which can host a wind farm that can deliver the most power but also be built under specified budget constraints, is decided. Pathways toward carbon-free energy system: Utility in many regions across the U.S. have publicly stated emission reduction goals to reduce carbon footprint of local electric power system. How to plan in a region with both old fossil fuel plants and site-specific renewable alternatives is the key question for analysts. In a project to make capacity planning for a 3-bus electric power system, I lead a group of 4 to explore different renewable scenarios to enhance the proportion of green power in the grid by 10 years later. The purpose is to maximize aggregate carbon emission reduction, minimize total cost of new construction or retrofit, and meet annual system electricity demand. A capacity planning model based on Python (Pulp package) is built to examine plans that incorporate different resources at different times. New capacity under consideration includes residential roof-top solar, utility solar PV, large CSP facility, wind turbine and energy storage system. A last optimal plan is given by the model showing the construction schedule of new renewable capacities among 10 years and recommend-retired year for existing coal or natural gas plants. Energy time series data analysis and forecast: To predict future electricity usage, grid load, generation from intermittent resources, and many other energy-related indicators, time series model is a powerful tool. By fitting and analyzing past behavior of a variable, people can forecast future activities and plan for future operations. In a research aimed at studying patterns of Japan’s oil and gas import, I use R to fit time series models on O &amp; G imports data from 1997 to 2019 and deploy the best-fit ones to forecast imports volume 5 years after. Each model’s performance is evaluated based on goodness of matching at inflection points, fitting residuals pattern, and accuracy measures such as MRE, RMSE and MAPE. In addition, analyzing how the imports pattern of both O &amp; G have changed before and after Fukushima Event reflects the disruption of nuclear power loss on Japan’s energy system. Environmental Science and Policy TopicsSupervised by Prof. Xu Zhao, Shandong University; Prof. Xin Zhang, University of Maryland Center for Environmental Science. Related publications: X.Zhang, X.Zhao, R.Li, G.Mao, et al, Evaluating the vulnerability of physical and virtual water resource networks in China’s megacities. Resources, Conservation and Recycling, 161 (2020). X.Liao, X.Zhao, W.Liu, R.Li, X.Wang et al, Comparing water footprint and water scarcity footprint of energy demand in China’s six megacities. Applied Energy, 269 (2020) Global scarce water saving through International crop trade: Agricultural products trade is associated with virtual water transfer between trading partners. When the amount of virtual water transfer is lower than a hypothetical water use in importing countries to produce the same commodities, a global water saving is generated. When further taking domestic water scarcity into account, scarce water saving can also be estimated. In an undergraduate research, I used Python to calculate virtual scare water savings embodied in crop trade among 199 countries in 2015 and examine the relationship between a country’s water stress index and net virtual water imports. The result identified specific trade links that generate large amount of virtual water savings (see figure below) and exporter-importer pairs that significantly intensify water scarcity in exporting countries. Managing nitrogen for sustainable agriculture: Large scale of croplands nourished more than half the world’s people, but also intensified the escape of reactive N from agricultural soils. Global trade enables one nitrogen-intensive country to import crops from a lightly-polluted country, thus reducing total amount of nitrogen leaking to the atmosphere or riverways. In an undergraduate research, I quantified the amount of nitrogen loss embedded in crop outflows and examined the role of 16 categories of agricultural products trade on alleviating global nitrogen pollution from 1986 to 2011, as shown in the figure below. Evaluating water resource networks’ vulnerability in China: The water resource networks that provide water for urban consumption consists of both physical and virtual water supply. However, relying on external water footprints can influence the vulnerability of cities’ water networks. In an research to evaluate water vulnerability of China’s six megacities, we developed a vulnerability index and calculated physical / virtual water flows in six megacities’ networks based on a multi-region input-output model. The results enable urban water planners to internalize the risk of external water footprint and avoid importing water-intensive products from regions suffering from extreme water stress."},{"title":"Corporate Renewable Path -- Market Tools and Criticisms","date":"2020-06-18T04:00:00.000Z","updated":"2020-06-28T02:08:20.862Z","comments":false,"path":"writings/index3.html","permalink":"http://yoursite.com/writings/index3.html","excerpt":"","text":"Business interests in renewable energy investment have surged from the last decade. Many corporations around the world have adopted elaborate measures to meet ambitious sustainability targets. Depending on different corporation goals, external market rules and operation models, there are various market tools available for a company to arrange for a successful emissions management plan. However, some environmentalists argue that details regarding their actual behaviors and procurement progress released publicly are not supportive enough for people to fully understand their sustainability claims. In this report, I will briefly introduce the variations in each approach and state how specific sustainability method has been condemned inefficient. [ pdf ]"},{"title":"Research on U.S. Crude Oil Market","date":"2019-09-29T04:00:00.000Z","updated":"2020-06-28T02:08:15.228Z","comments":false,"path":"writings/index.html","permalink":"http://yoursite.com/writings/index.html","excerpt":"","text":"After an attack on Saudi Arabia’s key production facilities, President Donald Trump has claimed to authorize the release of oil from the U.S. strategic petroleum reserve “to keep the markets well-supplied”. Under the situation when U.S. briefly became the world’s No.1 oil extractor and exporter after the shale oil revolution, there seems to be some irrationalities in America’s urgent response to this oil shortage crisis. In this report, I explored the reason why America still need oil imports from the Middle East area to support supplies market when they’ve already held a rich domestic production. [ pdf ]"},{"title":"Development of Global Oil Giant’s Renewable Business","date":"2020-05-21T04:00:00.000Z","updated":"2020-06-28T01:35:02.182Z","comments":false,"path":"writings/index2.html","permalink":"http://yoursite.com/writings/index2.html","excerpt":"","text":"As the impact of COVID-19 pandemic rages all over the world, global oil demand has slumped to a 25-year low. The following production disputes between Saudi Arabia and Russia deepened the supply-side crisis and led to a historically low oil price of $24.88 /barrel in Mar.18th. However, even when all oil companies are cutting costs to improve the financial situation, their renewable energy businesses are mostly spared untouched. In this long report, I’m interested in seeing how those fossil fuel companies have embraced clean energy projects for the last decades and whether they can transit deeper toward carbon-free model in the darkest moment of the oil industry. [ pdf ]"},{"title":"Nikola V.S. Tesla:\\ hydrogen fuel cells or electric?","date":"2020-07-12T04:00:00.000Z","updated":"2020-07-12T14:59:52.781Z","comments":false,"path":"writings/index4.html","permalink":"http://yoursite.com/writings/index4.html","excerpt":"","text":"Nikola Motor, a hydrogen and electric truck startup, has been a rising star in the market. After completing its reverse merger with public-traded company VectoIQ Acquisition Corp, Nikola Motor surged at most 130% in the first week of trading, even when no products are delivered in the market. As a fuel-cell pioneer in the vehicle industry, Nikola has gained a market value higher than any other automakers in America except General Motors and Tesla Motor. Discussion between hydrogen and battery-backed electric vehicles also revived with the new Nasdaq business. In this report, we will discuss the following questions: In terms of technical parameters and vehicle performance, what’s the difference between Tesla’s electric semi and Nikola’s hydrogen truck? What challenges will Nikola have to address in the next few years before commercial products enter production? Is there any external influence factor the company need to be prepared? And finally, CAN Nikola replicate Tesla’s success and occupy substaintial market share in vehile industry? [ pdf ]"},{"title":"Presentations","date":"2021-04-25T02:29:35.726Z","updated":"2021-04-25T02:29:35.726Z","comments":false,"path":"Pre/index.html","permalink":"http://yoursite.com/Pre/index.html","excerpt":"","text":"2021 Jan. 10$^{th}$ - 17$^{th}$, Online presentations Conference: The 2$^{nd}$ Tsinghua University International Forum on Energy Transition &amp; Pathway to Carbon Neutrality Vision Seminar. Contributed Topics: Citizen’s Solar Power Plants in Austria Slovenia’s Solar Net Metering Policy The Race to Zero-Carbon Power Systems in Europe Nuclear Power in the European Union: Keep or Phase-out? Germany’s Electric System with High Percentage of Renewables 2020 Dec. 10$^{th}$, Online talks Organizer: China Energy Internet Alliance, Energy IoT Committee. Contributed Talk: Development of the PV market in Austria and Slovenia and Implications for China Policymakers. Click to access the Recording Link ."},{"title":"CV","date":"2020-12-25T04:22:57.733Z","updated":"2020-12-25T04:22:57.733Z","comments":false,"path":"cv/pre1.html","permalink":"http://yoursite.com/cv/pre1.html","excerpt":"","text":"[ Contact to have a look at my CV if you’re interested!]&nbsp; Education Master in Environmental Management (Energy and Environment concentration), Duke University, expected May 2021 B.E. Environmental Science, Hohai University, June 2019 Skills Coding: C, Python, R, MySQL, LATEX, VBA Data Analysis: Python (pandas, numpy, scipy), R (dplyr, tidyr), Excel modeling, PowerWorld Simulator Data Visulization: Python (matplotlib), R (ggplot), ECHARTS, ArcGIS pro, CIRCOS Optimization: Python (PuLP, docplex, Pyomo), IBM ILOG CPLEX Optimization Misc. : Academic Research, MS Office, Adobe Photoshop &amp; Premiere, Markdown Language: Mandarin Chinese, English, Spanish Hobby: Swimming, Running, Jazz drum Certificates Bloomberg Market Concepts (#160072356334), awarded by Bloomberg Certificate of Data Analyst with SQL Server (#129,356), awarded by DataCamp Certification of Data Scientist with Python (#93,176), awarded by DataCamp Certificate of Quantitative Analysis Using R(#138,613), awarded by DataCamp"}],"posts":[{"title":"the 2020 California Blackout: Another Electricity Crisis?","slug":"index8","date":"2020-12-23T05:00:00.000Z","updated":"2021-01-13T00:13:26.070Z","comments":false,"path":"2020/12/23/index8/","link":"","permalink":"http://yoursite.com/2020/12/23/index8/","excerpt":"","text":"At a time of remarkable acceleration in the worldwide economies’ transition to clean energy, California state has been leading all states in the U.S. for consecutive years. The renewable market trends and clean technology advances started by California wields enormous power to influence environmental policy nationally and even globally. The progress of California’s energy market transition thus is closely watched by public and media. Nearly 20 years ago, shortly after California turned to the new wholesale power market and innovative customer choice program, a series of significant supply shortages and blackouts in California had attracted much attention from the media. The arguments on market manipulation, aftermath of several utility bankruptcy, and temporal economic stagnation still haunted the California people until now. However, 20 years later, on August 14$^{th}$, 2020, grid operator CAISO issued another series of short-term rolling blackouts. For the first time since 2001, California is suffering another energy emergency and makes the headlines of major newspapers in the world again. But how exactly is this happening? Why weren’t the power managers able to plan ahead for this? And most importantly, what’s the essential difference between two outages in two decades? In this writeup, we will dive into some details of the darkening California electric system and find the culprits behind two supply shortage events. [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[]},{"title":"2060 Carbon Neutrality Goal: Solar Opportunity in China","slug":"index7","date":"2020-10-27T04:00:00.000Z","updated":"2020-12-26T20:43:37.673Z","comments":false,"path":"2020/10/27/index7/","link":"","permalink":"http://yoursite.com/2020/10/27/index7/","excerpt":"","text":"At the United Nations General Assembly on Sept. 22nd, China’s President Xi Jinping announced that China will strive to reach peak carbon emission by 2030 and become carbon neutral by 2060. For the world’s top carbon emitter and second-largest economy, such a pledge is bold and ambitious. Tsinghua University’s Institute of Energy, Environment and Economy, one of China’s top climate research institutes, has laid out a roadmap on Sept. 26th detailing the completely phase-out of coal power and surge in alternative energy for achieving net-zero. Under this plan, Solar will see the greatest boost in the next few decades. With the most ambitious climate goal ever seen in the world laying out timetables for the next round of energy revolution, what’s needed next is a more specific roadmap accompanying all existing and new PV policies. In this writeup, several pathways for driving solar energy expansion in China are proposed. All hold the potential to continuously keep China’s solar capacity growing and decarbonize the power grid. [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[]},{"title":"Solving optimization problems in power system based on Python PuLP, docplex and Pyomo package [available in both Chinese and English]","slug":"index5","date":"2020-10-01T04:00:00.000Z","updated":"2020-11-09T03:13:20.921Z","comments":false,"path":"2020/10/01/index5/","link":"","permalink":"http://yoursite.com/2020/10/01/index5/","excerpt":"","text":"The electric system usually involves optimization problems. In this documentation, we will introduce three basic optimization problems: the UCED model in a 3-bus power system, renewable capacity planning for an ISO in the future 10 years, and residential Solar plus Storage system management. We will each go through basic grammars and apply PuLP, docplex, and Pyomo package to build models for solving the three problems. This documentation is available both in Chinese and English. [ Contact me to get the Chinese version if you’re interested!][ Contact me to get the English version if you’re interested!]","categories":[],"tags":[]},{"title":"Policy Mix for Emissions Reduction and Renewables Development","slug":"index6","date":"2020-08-03T04:00:00.000Z","updated":"2020-12-26T20:42:49.853Z","comments":false,"path":"2020/08/03/index6/","link":"","permalink":"http://yoursite.com/2020/08/03/index6/","excerpt":"","text":"Concerns about global warming and climate change have led countries in the world to adopt various policy schemes for reducing national carbon footprint. As the source of two-thirds of global GHG emissions, the energy sector (including energy production and use) has been at the core of efforts. Governments at different levels apply a mix of policies to reduce GHG emissions from the power industry and significantly expand the use of carbon-free renewable sources. Born out of comprehensive considerations between social, political, legal, and administrative factors, the mechanism for each scheme varies and usually has a different approach or target group. In this write-up, we will briefly review several effective schemes adopted by world governments and see how those policy instruments differ from each other. [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[]},{"title":"Nikola V.S. Tesla: Hydrogen Fuel Cells or Battery?","slug":"index4","date":"2020-07-11T04:00:00.000Z","updated":"2020-09-15T03:01:47.851Z","comments":false,"path":"2020/07/11/index4/","link":"","permalink":"http://yoursite.com/2020/07/11/index4/","excerpt":"","text":"Nikola Motor, a hydrogen and electric truck startup, has been a rising star in the market. After completing its reverse merger with public-traded company VectoIQ Acquisition Corp, Nikola Motor surged at most 130% in the first week of trading, even when no products are delivered in the market. As a fuel-cell pioneer in the vehicle industry, Nikola has gained a market value higher than any other automakers in America except General Motors and Tesla Motor. Discussion between hydrogen and battery-backed electric vehicles also revived with the new Nasdaq business. In this report, we will discuss the following questions: In terms of technical parameters and vehicle performance, what’s the difference between Tesla’s electric semi and Nikola’s hydrogen truck? What challenges will Nikola have to address in the next few years before commercial products enter production? Is there any external influence factor the company need to be prepared? And finally, CAN Nikola replicate Tesla’s success and occupy substaintial market share in vehile industry? [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[]},{"title":"Corporate Renewable Path -- Market Tools and Criticisms","slug":"index3","date":"2020-06-18T04:00:00.000Z","updated":"2020-09-15T03:01:40.539Z","comments":false,"path":"2020/06/18/index3/","link":"","permalink":"http://yoursite.com/2020/06/18/index3/","excerpt":"","text":"Business interests in renewable energy investment have surged from the last decade. Many corporations around the world have adopted elaborate measures to meet ambitious sustainability targets. Depending on different corporation goals, external market rules and operation models, there are various market tools available for a company to arrange for a successful emissions management plan. However, some environmentalists argue that details regarding their actual behaviors and procurement progress released publicly are not supportive enough for people to fully understand their sustainability claims. In this report, I will briefly introduce the variations in each approach and state how specific sustainability method has been condemned inefficient. [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[]},{"title":"Development of Global Oil Giant’s Renewable Business [updated in August, 2020]","slug":"index2","date":"2020-05-21T04:00:00.000Z","updated":"2020-09-15T03:01:18.186Z","comments":false,"path":"2020/05/21/index2/","link":"","permalink":"http://yoursite.com/2020/05/21/index2/","excerpt":"","text":"As the impact of COVID-19 pandemic rages all over the world, global oil demand has slumped to a 25-year low. The following production disputes between Saudi Arabia and Russia deepened the supply-side crisis and led to a historically low oil price of $24.88 /barrel in Mar.18th. However, even when all oil companies are cutting costs to improve the financial situation, their renewable energy businesses are mostly spared untouched. In this long report, I’m interested in seeing how those fossil fuel companies have embraced clean energy projects for the last decades and whether they can transit deeper toward carbon-free model in the darkest moment of the oil industry. [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[]},{"title":"Research on U.S. Crude Oil Market","slug":"index","date":"2019-09-29T04:00:00.000Z","updated":"2020-12-21T19:56:05.067Z","comments":false,"path":"2019/09/29/index/","link":"","permalink":"http://yoursite.com/2019/09/29/index/","excerpt":"","text":"After an attack on Saudi Arabia’s key production facilities, President Donald Trump has claimed to authorize the release of oil from the U.S. strategic petroleum reserve “to keep the markets well-supplied”. Under the situation when U.S. briefly became the world’s No.1 oil extractor and exporter after the shale oil revolution, there seems to be some irrationalities in America’s urgent response to this oil shortage crisis. In this report, I explored the reason why America still need oil imports from the Middle East area to support supplies market when they’ve already held a rich domestic production. [ Contact me to get the pdf if you’re interested!]","categories":[],"tags":[{"name":"writting","slug":"writting","permalink":"http://yoursite.com/tags/writting/"}]}],"categories":[],"tags":[{"name":"writting","slug":"writting","permalink":"http://yoursite.com/tags/writting/"}]}